
typedef union
{
	unsigned char bData[4];
	int dwData; 
} Union_400033c8; //400033c8

typedef union
{
	unsigned char bData[4];
	int dwData; 
} Union_400033cc; //400033cc

typedef union
{
	unsigned char bData[2]; 
	unsigned short wData;
} Union_40002c24;

typedef union
{
	unsigned char bData[4]; 
	int Data;
} Union_40002c28;

typedef struct
{
	int Data_0; //0
	double dData_8; //8
	double dData_16; //16
	double dData_24; //24
	double dData_32; //32
	int Data_40; //40
	unsigned char bData_44; //44
	double dData_48; //48
	double dData_56; //56
	int Data_64; //64
	int Data_68; //68
	double dData_72; //72
	double dData_80; //80
	double dData_88; //88
	double dData_96; //96
	double dData_104; //104
	double dData_112; //112
	double dData_120; //120
	double dData_128; //128
	double dData_136; //136
	double dData_144; //144
	double dData_152; //152
	double dData_160; //160
	double dData_168; //168
	double dData_176; //176
	double dData_184; //184
	double dData_192; //192
	double dData_200; //200
	double dData_208; //208
	double dData_216; //216
	double dData_224; //224
	double dData_232; //232
	double dData_240; //240
	double dData_248; //248
	double dData_256; //256
	double dData_264; //264
	int fill_272[8]; //272
	double dData_304; //304
	double dData_312; //312
	int fill_320[2]; //320
	double dData_328; //328
	double dData_336; //336
	char bData_344; //344
	char bData_345; //345
	int Data_348; //348
	int Data_352; //352
	char bData_356; //356
	char bData_357; //357
	char bData_358; //358
	int Data_360; //360
	char bData_364; //364
	int fill_368; //368
	int Data_372; //372
	double dData_376; //376
	double dData_384; //384
	double dData_392; //392
	double dData_400; //400
	double dData_408; //408
	double dData_416; //416
	double dData_424; //424
	double dData_432; //432
	double dData_440; //440
	double dData_448; //448
	double dData_456; //456
	double dData_464; //464
	double dData_472; //472
	double dData_480; //480
	double dData_488; //488
	double dData_496; //496
	double dData_504; //504
	double dData_512; //512
	int fill_520[16]; //520
	double dData_584; //584
	double dData_592; //592
	
} Struct_40004128;

typedef struct
{
	double dData_0; //0
	double dData_8; //8
	double dData_16; //16
	double dData_24; //24
	double dData_32; //32
	double dData_40; //40
	
} Struct_40004380;

extern unsigned char Data_40000000[28][10]; //40000000
extern unsigned char Data_40000118[28][22]; //40000118, size?? -> 40000380???
extern char Data_40000380[]; //40000380
extern char Data_4000038a[]; //4000038a
extern char Data_40000394[]; //40000394
extern char Data_4000039e[]; //4000039e
extern char Data_400003a8[]; //400003a8
extern char Data_400003b2[]; //400003b2
extern char Data_400003ba[]; //400003ba
extern char Data_400003c2[]; //400003c2
extern char Data_400003ca[]; //400003ca
extern char Data_400003d4[]; //400003d4
extern char Data_400008ad[]; //400008ad, size??
extern char Data_400008bd[]; //400008bd, size???
extern char Data_400008c8[]; //400008c8, size???
extern char Data_400008d2[]; //400008d2, size???
extern char Data_400008d8[]; //400008d8, size???
extern char Data_400008e7[]; //400008e7, size???
extern char Data_400008f6[]; //400008f6, size???
extern char Data_40000907[]; //40000907, size???
extern char Data_40000913[]; //40000913, size???
extern char Data_40000923[]; //40000923, size???
extern char Data_40002655[]; //40002655, size???
extern char Data_40002660[]; //40002660, size???
extern unsigned char Data_40002827[]; //40002827
extern char Data_40002837[]; //40002837
extern char Data_40002847[]; //40002847
extern char Data_40002856[]; //40002856
extern unsigned char Data_40002bf8[8]; //40002bf8, size??
extern unsigned char bData_40002c00; //40002c00
extern unsigned char bData_40002c01; //40002c01
extern unsigned char bData_40002c02; //40002c02
extern unsigned char bData_40002c03; //40002c03
extern unsigned char bData_40002c04; //40002c04
extern unsigned char bData_40002c05; //40002c05
extern unsigned char bData_40002c06; //40002c06
extern unsigned char bData_40002c07; //40002c07
extern unsigned char bData_40002c08; //40002c08
extern unsigned char bData_40002c09; //40002c09
extern unsigned char bData_40002c0a; //40002c0a
extern char bData_40002c0b; //40002c0b
extern unsigned char bData_40002c0c; //40002c0c
extern unsigned char bData_40002c0d[4]; //40002c0d
extern unsigned char uart0_bRxData; //40002c11
extern unsigned char bData_40002c12; //40002c12
extern char bData_40002c13; //40002c13
extern unsigned char bData_40002c14; //40002c14
extern unsigned char bData_40002c15[4]; //40002c15
extern unsigned char uart1_bRxData; //40002c19
extern char bData_40002c1a; //40002c1a // V2.2: 40002c1e
extern int Data_40002c1c; //40002c1c
extern int Data_40002c20; //40002c20
extern Union_40002c24 Data_40002c24; //40002c24
extern Union_40002c28 Data_40002c28; //40002c28
extern char bData_40002c58; //40002c58
extern char bData_40002c5a; //40002c5a
extern int Data_40002c64; //40002c64
extern char bData_40002c68; //40002c68
extern char bData_40002c69; //40002c69
extern char bData_40002c6a; //40002c6a
extern double dData_40002c88; //40002c88
extern double dData_40002c90; //40002c90
extern double dData_40002c98; //40002c98
extern double dData_40002ca0; //40002ca0
extern double dData_40002ca8; //40002ca8
extern double dData_40002cb0; //40002cb0
extern int Data_40002cb8; //40002cb8
extern int Data_40002cbc; //40002cbc
extern float fData_40002cc0; //40002cc0
extern double dData_40002cc8; //40002cc8
extern float fData_40002cd0; //40002cd0
extern int Data_40002cd8; //40002cd8
extern int Data_40002cdc; //40002cdc
extern float fData_40002ce0; //40002ce0
extern double dData_40002ce8; //40002ce8
extern int Data_40002cf4; //40002cf4
extern int Data_40002cf8; //40002cf8
extern float fData_40002cfc; //40002cfc
extern int Data_40002d00; //40002d00
extern int Data_40002d04; //40002d04
extern float fData_40002d08; //40002d08
extern double dData_40002d10; //40002d10
extern float fData_40002d18; //40002d18
extern int Data_40002d20; //40002d20
extern int Data_40002d24; //40002d24
extern float fData_40002d28; //40002d28
extern int Data_40002d40; //40002d40
extern int Data_40002d44; //40002d44
extern int Data_40002d48; //40002d48
extern int Data_40002d4c; //40002d4c
extern float fData_40002d50; //40002d50
extern int Data_40002d68; //40002d68
extern int Data_40002d6c; //40002d6c
extern float fData_40002d70; //40002d70
extern double dData_40002d78; //40002d78
extern double dData_40002d80; //40002d80
extern char bData_40002d88; //40002d88
extern int Data_40002d8c; //40002d8c
extern int Data_40002d90; //40002d90
extern float fData_40002d94; //40002d94
extern double dData_40002d98; //40002d98
extern double dData_40002da0; //40002da0
extern char bData_40002da8; //40002da8
extern int Data_40002dac; //40002dac
extern int Data_40002db0; //40002db0
extern float fData_40002db4; //40002db4
extern double dData_40002db8; //40002db8
extern double dData_40002dc0; //40002dc0
extern double dData_40002dc8; //40002dc8
extern double dData_40002dd0; //40002dd0
extern int Data_40002de0; //40002de0
extern int Data_40002de4; //40002de4
extern float fData_40002de8; //40002de8
extern double dData_40002df0; //40002df0
extern double dData_40002df8; //40002df8
extern double dData_40002e00; //40002e00
extern double dData_40002e08; //40002e08
extern int Data_40002e18; //40002e18
extern int Data_40002e1c; //40002e1c
extern float fData_40002e20; //40002e20
extern double dData_40002e28; //40002e28
extern int Data_40002e34; //40002e34
extern int Data_40002e38; //40002e38
extern int Data_40002e3c; //40002e3c
extern float fData_40002e40; //40002e40
extern int Data_40002e44; //40002e44
extern double dData_40002e48; //40002e48
extern int Data_40002e54; //40002e54
extern unsigned Data_40002e5c; //40002e5c
extern unsigned char bData_40002e60; //40002e60
extern unsigned char bData_40002e61; //40002e61
extern unsigned char bData_40002e62; //40002e62
extern unsigned char bData_40002e63; //40002e63
extern unsigned char bData_40002e64; //40002e64
extern unsigned short wData_40002e66; //40002e66
extern char bData_40002e78; //40002e78
extern unsigned char bData_40002e79_SkyLandTargetSeletion; //40002e79
extern char bData_40002e7a; //40002e7a
extern char bData_40002e7b; //40002e7b
extern char bData_40002e7c; //40002e7c
extern unsigned char bData_40002e7d; //40002e7d
extern char bData_40002e7e; //40002e7e
extern int Data_40002e80; //40002e80
extern int Data_40002e84; //40002e84
extern char bData_40002e88; //40002e88
extern char bData_40002e89; //40002e89
extern char bData_40002e8a; //40002e8a
extern char bData_40002e8b; //40002e8b
extern char bData_40002e8c; //40002e8c
extern int Data_40002e90; //40002e90
extern int Data_40002e94; //40002e94
extern float fData_40002e98; //40002e98
extern int Data_40002e9c; //40002e9c
extern int Data_40002ea0; //40002ea0
extern int Data_40002ea4; //40002ea4
extern float fData_40002ea8; //40002ea8
extern int Data_40002eac; //40002eac
extern int Data_40002eb0; //40002eb0
extern char bData_40002eb4; //40002eb4
extern unsigned char bData_40002eb5; //40002eb5
extern unsigned short wData_40002eb6; //40002eb6
extern unsigned short wData_40002eb8_MessierNr; //40002eb8
extern unsigned short wData_40002eba_NGCNr; //40002eba
extern unsigned short wData_40002ebc_ICNr; //40002ebc
extern unsigned short wData_40002ebe_ShNr; //40002ebe
extern unsigned short wData_40002ec0; //40002ec0
extern int Data_40002ec4_SAONr; //40002ec4
extern unsigned short wData_40002ecc; //40002ecc
extern unsigned char bData_40002ece; //40002ece
extern unsigned short wData_40002ed0; //40002ed0
extern unsigned char bData_40002ed2; //40002ed2
extern unsigned short wData_40002ed4; //40002ed4
extern unsigned short wData_40002ed6; //40002ed6
extern unsigned short wData_40002ed8; //40002ed8
extern unsigned short wData_40002eda; //40002eda
extern char bData_40002edd; //40002edd
extern char bData_40002ede; //40002ede
extern char bData_40002edf; //40002edf
extern char bData_40002ef6; //40002ef6
extern char bData_40002ef7; //40002ef7
extern int Data_40002ef8; //40002ef8
extern float fData_40002efc; //40002efc
extern float fData_40002f00; //40002f00
extern int Data_40002f04; //40002f04
extern int Data_40002f08; //40002f08
extern char bData_40002f0c; //40002f0c
extern unsigned char bData_40002f0d; //40002f0d
extern int Data_40002f10; //40002f10
extern unsigned char bData_40002f14_RecentTargetCount; //40002f14
extern unsigned char Data_40002f15[]; //40002f15, size???
extern unsigned char bData_40002f1d; //40002f1d
extern char bData_40002f1e; //40002f1e
extern char* Data_40002f20; //40002f20
extern char* Data_40002f24; //40002f24
extern char* Data_40002f28; //40002f28
extern char* Data_40002f2c; //40002f2c
extern char* Data_40002f30; //40002f30
extern char* Data_40002f34; //40002f34
extern char* Data_40002f38; //40002f38
extern char* Data_40002f3c; //40002f3c
extern char* Data_40002f40; //40002f40
extern char* Data_40002f44; //40002f44
extern char* Data_400030c0; //400030c0
extern char* Data_400030c4; //400030c4
extern char* Data_400030c8; //400030c8
extern char* Data_40003140; //40003140
extern char* Data_4000314c; //4000314c
extern char Data_40003150[]; //40003150, size??
extern char bData_4000316e; //4000316e
extern char bData_40003188; //40003188
extern char bData_40003189; //40003189
extern char bData_4000318a; //4000318a
extern int Data_4000318c; //4000318c
extern int Data_40003190; //40003190
extern char bData_40003194; //40003194
extern unsigned char bData_40003195; //40003195
extern unsigned char bData_40003196; //40003196
extern char bData_40003197; //40003197
extern char bData_40003198; //40003198
extern char bData_40003199; //40003199
extern unsigned char bData_4000319a_SkyLandTargetId; //4000319a
extern char bData_4000319b; //4000319b
extern char bData_4000319c; //4000319c
extern char bData_4000319d; //4000319d
extern int Data_400031a4; //400031a4
extern char bData_400031b8; //400031b8
extern char bData_400031b9; //400031b9
extern char bData_400031be; //400031be
extern char bData_400031bf; //400031bf
extern float fData_400031c0; //400031c0
extern float fData_400031c4; //400031c4
extern char bData_400031e0; //400031e0
extern char bData_400031e1; //400031e1
extern int Data_400031e4; //400031e4
extern char bData_400031e9; //400031e9
extern char bData_400031ea; //400031ea
extern char bData_400031eb; //400031eb
extern char bData_400031ec; //400031ec
extern char bData_400031ed; //400031ed
extern double dData_400031f0; //400031f0
extern double dData_400031f8; //400031f8
extern char bData_40003200; //40003200
extern char bData_40003201; //40003201
extern int Data_40003204; //40003204
extern int Data_40003208; //40003208
extern char bData_40003210; //40003210
extern char bData_40003211; //40003211
extern int Data_40003214; //40003214
extern int Data_40003220; //40003220
extern int Data_40003224; //40003224
extern int Data_40003228; //40003228
extern char bData_4000322c; //4000322c
extern char bData_4000322d; //4000322d
extern unsigned char bData_40003265; //40003265
extern float Data_4000329c; //4000329c
extern float Data_400032a0; //400032a0
extern char bData_400032a4; //400032a4
extern double dData_400032b0; //400032b0
extern double dData_400032b8; //400032b8
extern double dData_400032c0; //400032c0
extern double dData_400032c8; //400032c8
extern double dData_400032d0; //400032d0
extern double dData_400032d8; //400032d8
extern double dData_400032e0; //400032e0
extern double dData_400032e8; //400032e8
extern double dData_400032f0; //400032f0
extern double dData_400032f8; //400032f8
extern double dData_40003300; //40003300
extern double dData_40003308; //40003308
extern double dData_40003310; //40003310
extern double dData_40003318; //40003318
extern double dData_40003320; //40003320
extern double dData_40003328; //40003328
extern double dData_40003330; //40003330
extern double dData_40003338; //40003338
extern double dData_40003340; //40003340
extern double dData_40003348; //40003348
extern Struct_435c Data_40003350; //40003350
extern Struct_4b94 Data_40003358_SAORecord; //40003358
extern char* Data_40003360; //40003360
extern char* Data_40003364; //40003364
extern char* Data_40003368; //40003368
extern char* Data_4000336c; //4000336c
extern char* Data_40003370; //40003370
extern char* Data_40003374; //40003374
extern char* Data_40003378; //40003378
extern char* Data_4000337c; //4000337c
extern char* Data_40003380; //40003380
extern char* Data_40003384; //40003384
extern char* Data_40003388; //40003388
extern char* Data_4000338c; //4000338c
extern char* Data_40003390; //40003390
extern char* Data_40003394; //40003394
extern char* Data_40003398; //40003398
extern char* Data_4000339c; //4000339c
extern char* Data_400033a0; //400033a0
extern char* Data_400033a4; //400033a4
extern Union_400033c8 Data_400033c8; //400033c8
extern Union_400033cc Data_400033cc; //400033cc
extern double dData_400033d8; //400033d8
extern double dData_400033e0; //400033e0
extern int Data_40003408; //40003408
extern int Data_4000340c; //4000340c
extern double dData_40003410; //40003410
extern double dData_40003418; //40003418
extern double dData_40003420; //40003420
extern double dData_40003428; //40003428
extern char bData_40003430; //40003430
extern char bData_40003431; //40003431
extern char bData_40003432; //40003432
extern double dData_40003448; //40003448
extern double dData_40003450; //40003450
extern double dData_40003458; //40003458
extern double dData_40003460; //40003460
extern int Data_40003488; //40003488
extern int Data_4000348c; //4000348c
extern double dData_40003490; //40003490
extern char bData_40003498; //40003498
extern double dData_400034a0; //400034a0
extern char bData_400034a9; //400034a9
extern char bData_400034aa; //400034aa
extern char bData_400034b4; //400034b4
extern char bData_400034b5; //400034b5
extern float fData_400034b8; //400034b8
extern float fData_400034bc; //400034bc
extern float fData_400034c0; //400034c0
extern float fData_400034c4; //400034c4
extern float fData_400034c8; //400034c8
extern char bData_400034cc; //400034cc
extern double Data_400034d0; //400034d0
extern double Data_400034d8; //400034d8
extern double dData_400034e8; //400034e8
extern double dData_400034f8; //400034f8
extern char bData_40003505;  //40003505
extern float fData_40003508; //40003508
extern float fData_4000350c; //4000350c
extern float fData_40003510; //40003510
extern float fData_40003514; //40003514
extern float fData_40003518; //40003518
extern float fData_4000351c; //4000351c
extern float fData_40003520; //40003520
extern int Data_40003524; //40003524
extern unsigned char bData_40003528; //40003528
extern unsigned char bData_40003529; //40003529
extern unsigned char bData_4000352a; //4000352a
extern unsigned char bData_4000352b; //4000352b
extern unsigned char bData_4000352c; //4000352c
extern unsigned char bData_4000352d; //4000352d
extern unsigned char bData_4000352e; //4000352e
extern float fData_40003540; //40003540
extern float fData_40003544; //40003544
extern int Data_40003548; //40003548
extern unsigned char Data_40003588[]; //40003588 size???
extern unsigned char Data_40003592[]; //40003592 size????
extern int Data_4000359c[]; //4000359c, size??
extern int Data_400035bc; //400035bc
extern char Data_400037ec[]; //400037ec, size???
extern Struct_34e4 Data_40003d94; //40003d94
extern char Data_40003db0[]; //40003db0
extern Struct_38dc Data_40003dd4; //40003dd4
extern Struct_3b58 Data_40003e08; //40003e08
extern Struct_4028 Data_40003ea0; //40003ea0
extern Struct_4594 Data_40003ec0; //40003ec0
extern Struct_4894 Data_40003ee0; //40003ee0
extern Struct_5218 Data_40003f50; //40003f50
extern Struct_54e0 Data_40003f64; //40003f64
extern char Data_40003fa9[]; //40003fa9
extern char Data_40003fbe[]; //40003fbe
extern char Data_40003fd3[]; //40003fd3
extern char Data_40003fe8[]; //40003fe8
extern char Data_40003ffd[]; //40003ffd
extern char Data_40004012[]; //40004012
extern char Data_40004027[]; //40004027
extern char Data_4000403c[]; //4000403c
extern char Data_4000410e[]; //4000410e
extern Struct_40004128 Data_40004128; //40004128
extern Struct_40004380 Data_40004380; //40004380
extern Struct_8ba4_0 Data_40004ad8; //40004ad8
extern Struct_8ba4 Data_40004ae8; //40004ae8
extern double Data_40004b08[]; //40004b08, array?
extern unsigned char Data_40004bb8[]; //40004bb8
extern char Data_40004c58[]; //40004c58, size???

