
typedef union
{
	unsigned char bData[4];
	int dwData; 
} Union_400033c8; //400033c8

typedef union
{
	unsigned char bData[4];
	int dwData; 
} Union_400033cc; //400033cc

typedef union
{
	unsigned char bData[2]; 
	unsigned short wData;
} Union_40002c24;

typedef union
{
	unsigned char bData[4]; 
	int Data;
} Union_40002c28;

typedef struct
{
	int Data_0; //0
	double dData_8; //8
	double dData_16; //16
	double dData_24; //24
	double dData_32; //32
	int Data_40; //40
	unsigned char bData_44; //44
	double dData_48; //48
	double dData_56; //56
	int Data_64; //64
	int Data_68; //68
	double dData_72; //72
	double dData_80; //80
	double dData_88; //88
	double dData_96; //96
	double dData_104; //104
	double dData_112; //112
	double dData_120; //120
	double dData_128; //128
	double dData_136; //136
	double dData_144; //144
	double dData_152; //152
	double dData_160; //160
	double dData_168; //168
	double dData_176; //176
	double dData_184; //184
	double dData_192; //192
	double dData_200; //200
	double dData_208; //208
	double dData_216; //216
	int fill_224[4]; //224
	double dData_240; //240
	double dData_248; //248
	double dData_256; //256
	double dData_264; //264
	int fill_272[8]; //272
	double dData_304; //304
	double dData_312; //312
	int fill_320[2]; //320
	double dData_328; //328
	double dData_336; //336
	int fill_344[2]; //344
	int Data_352; //352
	char bData_356; //356
	char bData_357; //357
	int fill_360[56]; //360
	double dData_584; //584
	double dData_592; //592
	
} Struct_40004128;

typedef struct
{
	double dData_0; //0
	double dData_8; //8
	double dData_16; //16
	double dData_24; //24
	double dData_32; //32
	double dData_40; //40
	
} Struct_40004380;

extern unsigned char Data_40000000[28][10]; //40000000
extern unsigned char Data_40000118[28][22]; //40000118, size??
extern char Data_40002655[]; //40002655, size???
extern char Data_40002660[]; //40002660, size???
extern char bData_40002837; //40002837
extern unsigned char Data_40002bf8[8]; //40002bf8, size??
extern unsigned char bData_40002c00; //40002c00
extern unsigned char bData_40002c01; //40002c01
extern unsigned char bData_40002c02; //40002c02
extern unsigned char bData_40002c03; //40002c03
extern unsigned char bData_40002c04; //40002c04
extern unsigned char bData_40002c05; //40002c05
extern unsigned char bData_40002c06; //40002c06
extern unsigned char bData_40002c07; //40002c07
extern unsigned char bData_40002c08; //40002c08
extern unsigned char bData_40002c09; //40002c09
extern unsigned char bData_40002c0a; //40002c0a
extern char bData_40002c0b; //40002c0b
extern unsigned char bData_40002c0c; //40002c0c
extern unsigned char bData_40002c0d[4]; //40002c0d
extern unsigned char uart0_bRxData; //40002c11
extern unsigned char bData_40002c12; //40002c12
extern char bData_40002c13; //40002c13
extern unsigned char bData_40002c14; //40002c14
extern unsigned char bData_40002c15[4]; //40002c15
extern unsigned char uart1_bRxData; //40002c19
extern char bData_40002c1a; //40002c1a
extern int Data_40002c1c; //40002c1c
extern int Data_40002c20; //40002c20
extern Union_40002c24 Data_40002c24; //40002c24
extern Union_40002c28 Data_40002c28; //40002c28
extern char bData_40002c58; //40002c58
extern char bData_40002c5a; //40002c5a
extern int Data_40002c64; //40002c64
extern char bData_40002c68; //40002c68
extern char bData_40002c69; //40002c69
extern char bData_40002c6a; //40002c6a
extern double dData_40002c88; //40002c88
extern double dData_40002c90; //40002c90
extern double dData_40002c98; //40002c98
extern double dData_40002ca0; //40002ca0
extern double dData_40002ca8; //40002ca8
extern double dData_40002cb0; //40002cb0
extern int Data_40002cb8; //40002cb8
extern int Data_40002cbc; //40002cbc
extern float fData_40002cc0; //40002cc0
extern int Data_40002cf4; //40002cf4
extern int Data_40002cf8; //40002cf8
extern float fData_40002cfc; //40002cfc
extern int Data_40002d20; //40002d20
extern int Data_40002d24; //40002d24
extern float fData_40002d28; //40002d28
extern int Data_40002d40; //40002d40
extern int Data_40002d48; //40002d48
extern int Data_40002d4c; //40002d4c
extern float fData_40002d50; //40002d50
extern int Data_40002d68; //40002d68
extern int Data_40002d6c; //40002d6c
extern float fData_40002d70; //40002d70
extern char bData_40002d88; //40002d88
extern int Data_40002d8c; //40002d8c
extern int Data_40002d90; //40002d90
extern float fData_40002d94; //40002d94
extern char bData_40002da8; //40002da8
extern int Data_40002dac; //40002dac
extern int Data_40002db0; //40002db0
extern float fData_40002db4; //40002db4
extern int Data_40002de0; //40002de0
extern int Data_40002de4; //40002de4
extern float fData_40002de8; //40002de8
extern int Data_40002e18; //40002e18
extern int Data_40002e1c; //40002e1c
extern float fData_40002e20; //40002e20
extern double dData_40002e28; //40002e28
extern int Data_40002e34; //40002e34
extern int Data_40002e38; //40002e38
extern int Data_40002e3c; //40002e3c
extern float fData_40002e40; //40002e40
extern int Data_40002e44; //40002e44
extern double dData_40002e48; //40002e48
extern int Data_40002e54; //40002e54
extern int Data_40002e5c; //40002e5c
extern unsigned char bData_40002e60; //40002e60
extern unsigned char bData_40002e61; //40002e61
extern unsigned char bData_40002e62; //40002e62
extern unsigned char bData_40002e63; //40002e63
extern unsigned char bData_40002e64; //40002e64
extern unsigned short wData_40002e66; //40002e66
extern char bData_40002e79; //40002e79
extern char bData_40002e7a; //40002e7a
extern char bData_40002e7b; //40002e7b
extern char bData_40002e7c; //40002e7c
extern unsigned char bData_40002e7d; //40002e7d
extern char bData_40002e7e; //40002e7e
extern int Data_40002e80; //40002e80
extern int Data_40002e84; //40002e84
extern char bData_40002e88; //40002e88
extern char bData_40002e89; //40002e89
extern char bData_40002e8b; //40002e8b
extern char bData_40002e8c; //40002e8c
extern int Data_40002e90; //40002e90
extern int Data_40002e94; //40002e94
extern float fData_40002e98; //40002e98
extern int Data_40002e9c; //40002e9c
extern int Data_40002ea0; //40002ea0
extern int Data_40002ea4; //40002ea4
extern float fData_40002ea8; //40002ea8
extern int Data_40002eac; //40002eac
extern int Data_40002eb0; //40002eb0
extern char bData_40002eb4; //40002eb4
extern char bData_40002eb5; //40002eb5
extern unsigned short wData_40002eb6; //40002eb6
extern unsigned short wData_40002eb8; //40002eb8
extern unsigned short wData_40002eba; //40002eba
extern unsigned short wData_40002ebc; //40002ebc
extern unsigned short wData_40002ebe; //40002ebe
extern unsigned short wData_40002ec0; //40002ec0
extern int Data_40002ec4; //40002ec4
extern unsigned short wData_40002ecc; //40002ecc
extern char bData_40002ece; //40002ece
extern unsigned short wData_40002ed0; //40002ed0
extern unsigned char bData_40002ed2; //40002ed2
extern unsigned short wData_40002ed4; //40002ed4
extern unsigned short wData_40002ed6; //40002ed6
extern unsigned short wData_40002ed8; //40002ed8
extern unsigned short wData_40002eda; //40002eda
extern char bData_40002ede; //40002ede
extern char bData_40002edf; //40002edf
extern char bData_40002ef6; //40002ef6
extern char bData_40002ef7; //40002ef7
extern int Data_40002ef8; //40002ef8
extern int Data_40002f04; //40002f04
extern int Data_40002f08; //40002f08
extern char bData_40002f0c; //40002f0c
extern char bData_40002f0d; //40002f0d
extern int Data_40002f10; //40002f10
extern char bData_40002f14; //40002f14
extern char bData_40002f1e; //40002f1e
extern char Data_40003150[]; //40003150, size??
extern char bData_4000316e; //4000316e
extern char bData_40003188; //40003188
extern char bData_40003189; //40003189
extern int Data_4000318c; //4000318c
extern int Data_40003190; //40003190
extern char bData_40003194; //40003194
extern char bData_40003195; //40003195
extern char Data_40003196; //40003196
extern char bData_40003197; //40003197
extern char bData_40003198; //40003198
extern char bData_40003199; //40003199
extern char bData_4000319b; //4000319b
extern char bData_4000319c; //4000319c
extern char bData_4000319d; //4000319d
extern char bData_400031b8; //400031b8
extern char bData_400031b9; //400031b9
extern char bData_400031be; //400031be
extern char bData_400031bf; //400031bf
extern float fData_400031c0; //400031c0
extern float fData_400031c4; //400031c4
extern char bData_400031e0; //400031e0
extern char bData_400031e1; //400031e1
extern int Data_400031e4; //400031e4
extern char bData_400031e9; //400031e9
extern char bData_400031ea; //400031ea
extern char bData_400031eb; //400031eb
extern char bData_400031ec; //400031ec
extern char bData_400031ed; //400031ed
extern double dData_400031f0; //400031f0
extern double dData_400031f8; //400031f8
extern char bData_40003200; //40003200
extern char bData_40003201; //40003201
extern int Data_40003204; //40003204
extern int Data_40003208; //40003208
extern char bData_40003210; //40003210
extern char bData_40003211; //40003211
extern int Data_40003214; //40003214
extern int Data_40003220; //40003220
extern int Data_40003224; //40003224
extern int Data_40003228; //40003228
extern char bData_4000322c; //4000322c
extern char bData_4000322d; //4000322d
extern unsigned char bData_40003265; //40003265
extern float Data_4000329c; //4000329c
extern float Data_400032a0; //400032a0
extern char bData_400032a4; //400032a4
extern char* Data_40003360; //40003360
extern char* Data_40003364; //40003364
extern char* Data_40003368; //40003368
extern char* Data_4000336c; //4000336c
extern char* Data_40003370; //40003370
extern char* Data_40003374; //40003374
extern char* Data_40003378; //40003378
extern char* Data_4000337c; //4000337c
extern char* Data_40003380; //40003380
extern char* Data_40003384; //40003384
extern char* Data_40003388; //40003388
extern char* Data_4000338c; //4000338c
extern char* Data_40003390; //40003390
extern char* Data_40003394; //40003394
extern char* Data_40003398; //40003398
extern char* Data_4000339c; //4000339c
extern Union_400033c8 Data_400033c8; //400033c8
extern Union_400033cc Data_400033cc; //400033cc
extern double dData_400033d8; //400033d8
extern double dData_400033e0; //400033e0
extern int Data_40003408; //40003408
extern int Data_4000340c; //4000340c
extern double dData_40003410; //40003410
extern double dData_40003418; //40003418
extern double dData_40003420; //40003420
extern double dData_40003428; //40003428
extern char bData_40003431; //40003431
extern char bData_40003432; //40003432
extern double dData_40003448; //40003448
extern double dData_40003450; //40003450
extern double dData_40003458; //40003458
extern double dData_40003460; //40003460
extern int Data_40003488; //40003488
extern int Data_4000348c; //4000348c
extern double dData_400034a0; //400034a0
extern float fData_400034c0; //400034c0
extern float fData_400034c4; //400034c4
extern float fData_400034c8; //400034c8
extern char bData_400034cc; //400034cc
extern double Data_400034d0; //400034d0
extern double Data_400034d8; //400034d8
extern char bData_40003505;  //40003505
extern float fData_40003508; //40003508
extern float fData_4000350c; //4000350c
extern float fData_40003510; //40003510
extern float fData_40003514; //40003514
extern float fData_40003518; //40003518
extern float fData_4000351c; //4000351c
extern float fData_40003520; //40003520
extern int Data_40003524; //40003524
extern unsigned char bData_40003528; //40003528
extern unsigned char bData_40003529; //40003529
extern unsigned char bData_4000352a; //4000352a
extern unsigned char bData_4000352b; //4000352b
extern unsigned char bData_4000352c; //4000352c
extern unsigned char bData_4000352d; //4000352d
extern unsigned char bData_4000352e; //4000352e
extern float fData_40003540; //40003540
extern unsigned char Data_40003588[]; //40003588 size???
extern unsigned char Data_40003592[]; //40003592 size????
extern char Data_400037ec[]; //400037ec, size???
extern Struct_40004128 Data_40004128; //40004128
extern Struct_40004380 Data_40004380; //40004380
extern char Data_40004c58[]; //40004c58, size???

