
typedef union
{
	unsigned char bData[4];
	int dwData; 
} Union_400033c8; //400033c8

typedef union
{
	unsigned char bData[4];
	int dwData; 
} Union_400033cc; //400033cc

typedef union
{
	unsigned char bData[2]; 
	unsigned short wData;
} Union_40002c24;

typedef union
{
	unsigned char bData[4]; 
	int Data;
} Union_40002c28;

typedef struct
{
	int Data_0; //0
	double dData_8; //8
	double dData_16; //16
	double dData_24; //24
	double dData_32; //32
	int Data_40; //40
	unsigned char bData_44; //44
	double dData_48; //48
	double dData_56; //56
	int Data_64; //64
	int Data_68; //68
	double dData_72; //72
	double dData_80; //80
	double dData_88; //88
	double dData_96; //96
	double dData_104; //104
	double dData_112; //112
	double dData_120; //120
	double dData_128; //128
	double dData_136; //136
	double dData_144; //144
	double dData_152; //152
	double dData_160; //160
	double dData_168; //168
	double dData_176; //176
	double dData_184; //184
	double dData_192; //192
	double dData_200; //200
	double dData_208; //208
	double dData_216; //216
	double dData_224; //224
	double dData_232; //232
	double dData_240; //240
	double dData_248; //248
	double dData_256; //256
	double dData_264; //264
	double dData_272; //272
	double dData_280; //280
	double dData_288; //288
	double dData_296; //296
	double dData_304; //304
	double dData_312; //312
	int fill_320[2]; //320
	double dData_328; //328
	double dData_336; //336
	char bData_344; //344
	char bData_345; //345
	int Data_348; //348
	int Data_352; //352
	char bData_356; //356
	char bData_357; //357
	char bData_358; //358
	int Data_360; //360
	char bData_364; //364
	char bData_365; //365
	int Data_368; //368
	int Data_372; //372
	double dData_376; //376
	double dData_384; //384
	double dData_392; //392
	double dData_400; //400
	double dData_408; //408
	double dData_416; //416
	double dData_424; //424
	double dData_432; //432
	double dData_440; //440
	double dData_448; //448
	double dData_456; //456
	double dData_464; //464
	double dData_472; //472
	double dData_480; //480
	double dData_488; //488
	double dData_496; //496
	double dData_504; //504
	double dData_512; //512
	double dData_520; //520
	double dData_528; //528
	double dData_536; //536
	double dData_544; //544
	double dData_552; //552
	double dData_560; //560
	double dData_568; //568
	double dData_576; //576
	double dData_584; //584
	double dData_592; //592
	
} Struct_40004128;

typedef struct
{
	double dData_0; //0
	double dData_8; //8
	double dData_16; //16
	double dData_24; //24
	double dData_32; //32
	double dData_40; //40
	
} Struct_40004380;

extern unsigned char Data_40000000[28][10]; //40000000
extern unsigned char Data_40000118[28][22]; //40000118, size?? -> 40000380???
extern char Data_40000380[]; //40000380
extern char Data_4000038a[]; //4000038a
extern char Data_40000394[]; //40000394
extern char Data_4000039e[]; //4000039e
extern char Data_400003a8[]; //400003a8
extern char Data_400003b2[]; //400003b2
extern char Data_400003ba[]; //400003ba
extern char Data_400003c2[]; //400003c2
extern char Data_400003ca[]; //400003ca
extern char Data_400003d4[]; //400003d4
extern char strEngTelescopeAlign[]; //400008ad
extern char Data_400008bd[]; //400008bd, size???
extern char Data_400008c8[]; //400008c8, size???
extern char Data_400008d2[]; //400008d2, size???
extern char strEngOneStarAlign[]; //400008d8
extern char Data_400008e7[]; //400008e7, size???
extern char Data_400008f6[]; //400008f6, size???
extern char Data_40000907[]; //40000907, size???
