

/* 659c - complete */
void func_659c(unsigned short a)
{
	unsigned short b;
	for (; a > 1; a--)
	{
		for (b = 10000; b > 1; b--)
		{
		}
	}
}

struct
{
	int Data_0; //0
	double Data_8; //8
	double Data_16; //16
	double Data_24; //24
	double Data_32; //32
	int Data_40; //40
	char bData_44; //44
	double Data_48; //48
	double Data_56; //56
	int Data_64; //64
	int Data_68; //68
}
Data_40004128; //40004128

/* d2cc - todo */
void func_d2cc(void)
{
	Data_40004128.Data_0 = 1;
	Data_40004128.Data_40 = 1;
	Data_40004128.bData_44 = 0;
	//TODO
	Data_40004128.Data_8 = 15278.0;
	Data_40004128.Data_16 = 160.0;
	Data_40004128.Data_24 = 32.37;
	Data_40004128.Data_32 = 22.37;
	Data_40004128.Data_48 = 12.37;
	Data_40004128.Data_56 = 2.37;
	Data_40004128.Data_64 = 8;
	Data_40004128.Data_68 = 1;
}

