
typedef struct
{
	unsigned char bData_0[12]; //0
	unsigned char bData_12[12]; //12
	int Data_24; //24
	unsigned char bData_28[14]; //28
	unsigned char bData_42[10]; //42
	float fData_52; //52
	float fData_56; //56
	float fData_60; //60
} Struct_34e4;

typedef struct
{
	unsigned char bData_0[5]; //0
	unsigned char bData_5[21]; //5
	unsigned char bData_26[10]; //26
	float fData_36; //36
	float fData_40; //40
	unsigned short wData_44; //44
	unsigned char bData_46; //46
	unsigned char bData_47; //47
} Struct_38dc;

typedef struct
{
	unsigned short wData_0; //0
	float fData_4; //4
	float fData_8; //8
	float fData_12; //12
	double dData_16; //16
	unsigned char bData_24[8]; //24, size??
	unsigned char bData_32[16]; //32, size??
	unsigned char bData_48[12]; //48, size??
	unsigned char bData_60[26]; //60, size??
	unsigned char bData_86[22]; //86, size??
	unsigned char bData_108[36]; //108, size??
} Struct_3b58;

typedef struct
{
	unsigned char bData_0[18]; //0
	float fData_20; //20
	float fData_24; //24
	float fData_28; //28
} Struct_4028;

typedef struct
{
	unsigned char bData_0[5]; //0
	float fData_8; //8
	float fData_12; //12
	float fData_16; //16
	unsigned char bData_20[10]; //20 size??
} Struct_4594;

typedef struct
{
	unsigned char bData_0[5]; //0
	float fData_8; //8
	float fData_12; //12
	float fData_16; //16
	unsigned char bData_20[10]; //20 size??
} Struct_4894;

typedef struct
{
	unsigned char bData_0[10]; //0
	unsigned char bData_10[10]; //10
	float fData_20; //20
	float fData_24; //24
} Struct_4dd0;

typedef struct
{	
	unsigned char bData_0[20]; //0
	unsigned char bData_20[20]; //20
	float fData_40; //40
	float fData_44; //44
	int Data_48; //48
} Struct_4f5c;

typedef struct
{
	unsigned char bData_0; //0
	unsigned char bData_1[9]; //1
	float fData_12; //12
	float fData_16; //16
} Struct_5218;

typedef struct
{
	unsigned char bData_0;
	unsigned char bData_1[8]; //1
	float fData_12; //12
	float fData_16; //16
} Struct_54e0;

typedef struct
{
	unsigned short wYear; //0
	unsigned char bMonth; //2
	unsigned char bDay; //3
	unsigned char bHours; //4
	unsigned char bMinutes; //5
	unsigned char bSeconds; //6
	unsigned short wData_8; //8
} Struct_7d1c;

